<template>
    <van-nav-bar
      title="关于社区"
      left-text="返回"
      left-arrow
      fixed
      placeholder
      @click-left="onClickLeft"
    />
    <div class="content">
      <h3>社区条约</h3>
      <h4>一.社区禁止行为</h4>
      <p>
        本社区禁止发布违反法律法规，干扰本社区正常运营，以及侵犯其他用户或第三方合法权益的内容。违规行为一经确认，本社区将删除所有相关内容，并视情节对其进行警告、禁言处理。
      </p>
      <h4>二.违法有害</h4>
      <h5>严禁一切违法、暴力、血腥、恐怖或者其他敏感有害信息，包括但不限于：</h5>
      <p>1．反对宪法确定的基本原则</p>
      <p>2．危害国家安全，泄露国家秘密、分裂国家的内容</p>
      <p>3．损害国家形象，篡改或恶搞国旗、国歌、国家领导人等</p>
      <p>4．歪曲、丑化、亵渎、否定革命领袖、英雄烈士事迹和精神</p>
      <p>5．破坏民族团结，嘲笑、调侃、伤害民族和地域感情</p>
      <p>6．破坏国家宗教政策，宣扬邪教思想，恶意伤害民族宗教感情</p>
      <p>7．传播恐怖主义，大力渲染暴力血腥情景</p>
      <p>
        8．散布夸大、捏造、无法证明内容真实性等谣言，扰乱社会秩序、破坏社会稳定
      </p>
      <p>9．进行网络诈骗，造成他人财产损失</p>
      <p>10．传播国家明令禁止的内容</p>
      <p>11．侵犯他人合法权益的内容</p>
      <p>12．发布含有非法、违规产品和服务信息的内容</p>
      <p>13．展示个人持有具有杀伤力的危险管制物品</p>
      <p>14．破坏生态环境，虐待动物，捕杀、食用国家保护类动物</p>
      <p>15．教唆他人自残、自杀或违法犯罪</p>
      <h4>三.危害未成年人健康成长</h4>
      <h5>禁止任何损害未成年人身心健康和合法权益的内容和行为，包括不限于：</h5>
      <p>1．残害、虐待、体罚、恶意整蛊未成年人</p>
      <p>2．展示血腥内容或诱导未成年人自残、自杀</p>
      <p>3．恶意编辑或蓄意传播恐怖、惊悚、色情信息供未成年观看</p>
      <p>4．含有未成年人饮酒、吸烟、赌博、吸毒行为</p>
      <p>5．涉及实施未成年人性侵害或展示未成年性暗示、性行为</p>
      <p>6．宣扬未成年人不正常交友或婚育</p>
      <p>7．推销可能危害未成年人身心健康相关物品</p>
      <p>8．以各种名义对未成年人进行网络欺诈</p>
      <p>9．披露未成年人个人隐私信息的或有损未成年人人格尊严</p>
      <p>10．展示校园霸凌或者教唆未成年人实施网络暴力</p>
      <p>11．宣扬和鼓励未成年人厌学弃学</p>
      <p>12．未成年人故意展示社会痞气内容</p>
      <p>13．诱导未成年人过度追星，追捧黑界文化、祖安文化</p>
      <h4>四.垃圾广告</h4>
      <h5>禁止发布损害用户体验、扰乱本社区管理秩序的垃圾广告，包括但不限于：</h5>
      <p>
        1．有明确交易意图的推广、售卖行为，不限于游戏账号、化妆品、宠物、网络招聘等
      </p>
      <p>2．假借分享福利的名义，诱导用户离开本社区</p>
      <p>3．以隐蔽方式，对他人进行垃圾广告骚扰</p>
      <p>
        4．推广、出售违法有害信息、产品或服务，如黄赌毒、枪支弹药、假证等违禁品
      </p>
      <p>
        5．发布诈骗信息，如宠物邮费诈骗、推广虚假网络兼职、诱导点击有害导流链接等
      </p>
      <p>6．利用 bug 或者其他手段，恶意干扰本社区正常活动运营</p>
      <h3>免责声明</h3>
      <p>一、本社区不对用户发表的内容的正确性未进行认证。</p>
      <p>
        二、用户在本社区发表的内容仅表明其个人的立场和观点，并不
        代表本社区的立场或观点。作为内容的发表者，需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任。本社区不承担任何法律及连带责任。
      </p>
      <p>
        三、本社区不保证服务一定能满足用户的要求，也不保证服务不
        会中断，对服务中断的及时性、安全性和准确性也不做保证。
      </p>
      <h3>特此声明</h3>
      <p>
        本社区在此声明其内容及商品纯属虚构请勿认真，如有侵权请联系QQ:
        <a href="javascript:;">605******3760</a>
      </p>
    </div>
  </template>
  
  <script>
  import { useRouter } from 'vue-router'
  export default {
    setup() {
      const router = useRouter()
      function onClickLeft() {
        router.back()
      }
      return {
        onClickLeft
      }
    }
  }
  </script>
  
  <style lang="less" scoped>
  .content {
    margin: 10px;
    h3 {
      text-align: center;
    }
    h4 {
      margin-top: 10px;
      margin-bottom: 10px;
      color: rgb(22, 144, 184);
    }
    h5 {
      font-weight: 550;
    }
    p {
      margin: 0px;
    }
  }
  </style>
  